# Add versions
tap 'homebrew/versions'

# Add services
tap 'homebrew/services'

# Install cask with versions and fonts
tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'caskroom/fonts'

# Install universal ctags (a ctags fork that is being maintained)
tap 'universal-ctags/universal-ctags'

# Install command line tools
brew 'ack'
brew 'awscli'
brew 'coreutils'
brew 'diff-so-fancy'
brew 'editorconfig'
brew 'git'
brew 'heroku'
brew 'htop'
brew 'httpie'
brew 'hub'
brew 'imagemagick'
brew 'node'
brew 'nvm'
brew 'openssl'
brew 'phantomjs'
brew 'python3'
brew 'rbenv'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'ripgrep'
brew 'rlwrap'
brew 'ruby-build'
brew 'sbt'
brew 'shellcheck'
brew 'siege'
brew 'tmux'
brew 'fzf'
brew 'tree'
brew 'universal-ctags'
brew 'wget'
brew 'yarn'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'zsh-history-substring-search'
brew 'zsh-syntax-highlighting'
brew 'gpg2'
brew 'stack'
brew 'docker-compose'

# Install neovim
tap 'neovim/neovim'
brew 'neovim'

# Install Apps
cask 'appcleaner'
cask 'brave'
cask 'charles'
cask 'docker'
cask 'firefox'
cask 'firefoxdeveloperedition'
cask 'google-chrome'
cask 'google-hangouts'
cask 'harvest'
cask 'iterm2-beta'
cask 'java'
cask 'messenger'
cask 'owasp-zap'
cask 'skype'
cask 'slack'
cask 'spotify'
cask 'the-unarchiver'
cask 'transmission'
cask 'vlc'

cask 'spectacle'
cask 'google-photos-backup'
cask 'dash'
cask 'pomodone'
cask 'karabiner-elements'

# Install fonts
cask 'font-sauce-code-powerline'
cask 'font-iosevka'
