# Add versions
tap 'homebrew/versions'

# Add services
tap 'homebrew/services'

# Install cask with versions and fonts
tap 'caskroom/cask'
tap 'caskroom/versions'

# Install universal ctags (a ctags fork that is being maintained)

brew 'ack'
brew 'awscli'
brew 'coreutils'
brew 'diff-so-fancy'

# Coding
brew 'node'
brew 'nvm'
brew 'git'
brew 'tfenv'
brew 'ruby-build'
brew 'python3'
brew 'rbenv'
brew 'yarn'
brew 'stack'
brew 'gpg2'
cask 'docker'
brew 'docker-compose'
cask 'java'
brew 'jq'
brew 'yq'

# Shell
tap 'universal-ctags/universal-ctags'
cask 'iterm2'
brew 'universal-ctags'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'zsh-history-substring-search'
brew 'zsh-syntax-highlighting'
brew 'fzf'
brew 'tree'
brew 'tmux'
brew 'ripgrep'
brew 'rlwrap'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'parallel'
brew 'imagemagick'
brew 'openssl'
brew 'shellcheck'

# CLIs
brew 'wget'
brew 'htop'
brew 'httpie'
brew 'hub'

# Install neovim
tap 'neovim/neovim'
brew 'neovim'
brew 'editorconfig'

# Install Apps
cask 'firefox'
cask 'google-chrome'
cask 'the-unarchiver'
cask 'transmission'
cask 'vlc'

# Social
cask 'skype'
cask 'slack'
cask 'google-hangouts'
cask 'zoom'
cask 'pomodone'
cask 'spotify'
cask 'steam'

# System
cask 'spectacle'
cask 'karabiner-elements'

# GPU
cask 'gswitch'
cask 'macs-fan-control'

# Install fonts
tap 'homebrew/cask-fonts'
cask 'font-sauce-code-powerline'
cask 'font-iosevka-nerd-font'
